{
  "jobs": [
    {
      "id": 0,
      "company": "KPFF Consulting Engineers",
      "title": "Jr. System Administrator/Software Engineer",
      "period": "May 2024 - Present",
      "description": "Revamped the UI/UX of key components using React and Material-UI, enhancing user interaction and modernizing the design. Developed API endpoints in Node.js to automate tasks with Selenium scripts, improving workflows and boosting productivity. Implemented GitHub for version control and Docker for containerization, optimizing team collaboration and streamlining deployment workflows. Maintained a 99% uptime for administrative facilities by actively monitoring logs and escalating issues as needed.",
      "technologies": [
        {
          "id": 1,
          "item": "JavaScript"
        },
        {
          "id": 2,
          "item": "React"
        },
        {
          "id": 3,
          "item": "Express.js"
        },
        {
          "id": 3,
          "item": "Python"
        },
        {
          "id": 4,
          "item": "Selenium"
        },
        {
          "id": 5,
          "item": "Material UI"
        }
      ]
    },
    {
      "id": 1,
      "company": "Upwards (formerly WeeCare)",
      "title": "Jr. Software Engineer",
      "period": "Decemeber 2020 - November 2023",
      "description": "Delivered full-stack solutions by developing and optimizing API endpoints to support evolving business needs and service-oriented architectures. Enhanced web features and improved code maintainability by migrating over 40% of the React codebase from JavaScript to TypeScript. Extracted data from JSON objects via API calls, generating over 150,000 leads and contributing to more than 30% of the company's revenue. Strengthened application reliability by implementing comprehensive unit, integration, and user acceptance tests using Selenium, Jest, and PHPUnit. Created and maintained documentation on engineering best practices to facilitate effective knowledge sharing across teams.",
      "technologies": [
        {
          "id": 1,
          "item": "PHP"
        },
        {
          "id": 2,
          "item": "MySQL"
        },
        {
          "id": 3,
          "item": "HTML"
        },
        {
          "id": 4,
          "item": "CSS"
        },
        {
          "id": 5,
          "item": "JavaScript"
        },
        {
          "id": 6,
          "item": "React"
        },
        {
          "id": 7,
          "item": "Postman"
        },
        {
          "id": 8,
          "item": "DataDog"
        },
        {
          "id": 9,
          "item": "Sentry"
        }
      ]
    },
    {
      "id": 2,
      "company": "Data One POS, Inc.",
      "title": "Technical Intern",
      "period": "June 2019 - September 2019",
      "description": "Installed and maintained hardware components of Point-of-Sale systems and credit card terminals. Collaborated in a team to analyze and troubleshoot product issues, delivering effective customer service.",
      "technologies": null
    },
    {
      "id": 3,
      "company": "Flutterkik - Full-Stack Application",
      "title": "Projects",
      "period": "March 2024 - Present",
      "description": "Independently designed and developed a full-stack web application that empowers users to create personalized swim workouts and track USA Swimming event standards. Built a dynamic React front end with a responsive UI, while developing a robust backend using Node.js and Express.js to handle API requests and business logic. Integrated a MySQL database hosted on AWS RDS for scalable data management. Implemented secure authentication and authorization using JWT and cookies, ensuring data protection and user access control. Optimized performance and maintainability by following best practices in full-stack development.",
      "link": "flutterkik.com",
      "technologies": [
        {
          "id": 0,
          "item": "React"
        },
        {
          "id": 1,
          "item": "NodeJs"
        },
        {
          "id": 2,
          "item": "Express.js"
        },
        {
          "id": 3,
          "item": "JavaScript"
        },
        {
          "id": 4,
          "item": "HTML"
        },
        {
          "id": 5,
          "item": "CSS"
        },
        {
          "id": 6,
          "item": "JWT"
        },
        {
          "id": 8,
          "item": "MySQL"
        },
        {
          "id": 7,
          "item": "Zustand"
        }
      ]
    }
  ]
}
